app/controllers/tasks_controller.rb

  def show
    @mytask = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 2]]

  def edit
    @mytask = Task.find(params[:id].to_i)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 15]]

  def update
    @mytask = Task.find(params[:id].to_i)
    @mytask[:title] = params[:task]["title"]
    @mytask[:description] = params[:task]["description"]
    @mytask[:finished] = params[:task]["finished"]
    @mytask.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Go to Mariners game on Saturday"], ["updated_at", "2016-09-30 17:21:37.114955"], ["id", 7]]

  def toggle_completed
    @mytask = Task.find(params[:id].to_i)
    @mytask.update(finished: !@mytask.finished)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 16]]
UPDATE "tasks" SET "finished" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["finished", "f"], ["updated_at", "2016-09-30 22:04:37.361065"], ["id", 16]]

  def create
    s1 = Task.new
    s1.title = params[:task][:title]
    s1.description = params[:task][:description]
    s1.finished = params[:task][:finished]
    s1.save
---
INSERT INTO "tasks" ("title", "description", "finished", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Test 1"], ["description", "go home"], ["finished", "f"], ["created_at", "2016-09-30 01:57:08.044227"], ["updated_at", "2016-09-30 01:57:08.044227"]]

  def destroy
    @mytask = Task.destroy(params[:id].to_i)
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 2]]